{
  "version": 1,
  "namespace": "NG-Classifications",
  "description": "NG Security Incident Classification.",
  "values": [
    {
      "predicate": "Priority-1",
      "entry": [
        {
          "value": "P1",
          "expanded": "Priority 1",
          "description": "A complete loss of an operationally critical or business critical system/service. Operationally critical systems or services include CNI systems, systems that are directly linked to or support CNI systems, and those systems that support the management of the physical network infrastructure and/or emergency response that if not available for an extended period will impact upon the safe and reliable operation of National Grid Electricity Distribution. A connectivity outage to a critical site (for example Plymouth Data Centre, Pegasus Control Room) or multiple sites. An infrastructure failure impacting multiple critical applications or services. Any incident escalated to this level by National Grid."
        }       
      ]
    }
    {
      "predicate": "Priority-2",
      "entry": [
        {
          "value": "P2",
          "expanded": "Priority 2",
          "description": "A partial loss of an operationally critical or business critical system/service. A complete loss of a business core system/service. A network outage impacting a non-critical operational site/s. A significant loss of network connectivity (telephony or data) to a critical site. Any incident escalated to this level by National Grid."
        }       
      ]
    }
    {
      "predicate": "Priority-3",
      "entry": [
        {
          "value": "P3",
          "expanded": "Priority 3",
          "description": "A partial loss of a business core system/service. A complete loss of a business efficiency system/service. A failure to a network segment within a company location. Batch jobs for an operationally critical or business critical system which requires immediate attention to ensure the system/service is not further impacted or becomes unavailable as a result. Any incident escalated to this level by National Grid."
        }       
      ]
    }
    {
      "predicate": "Priority-4",
      "entry": [
        {
          "value": "P4",
          "expanded": "Priority 4",
          "description": "A partial loss of a business efficiency system/service. A 'How to' question by a client. A request initiated by a client. Minor loss of infrastructure (e.g. one of a number of networked printers) Password resets are normally resolved at first call. A minor loss of infrastructure impacting a single user (e.g. a single desktop related incident or one of a number of networked printers). Batch job failures for Business Core or Efficiency systems which may require expedited attention to ensure the system/service is not further impacted or becomes unavailable as a result."
        }       
      ]
    }
  ]
}
